app/views/groups/_groupads.html.erb

              </div>
            <% elsif ad.user_ad? || ad.group.permanent? %>
---
SELECT `groups`.* FROM `groups` WHERE `groups`.`id` = 137 LIMIT 1

            </div>
            <% @offer = Offer.find_by_ad_id(ad.id) %>
---
SELECT `offers`.* FROM `offers` WHERE `offers`.`ad_id` = 343 LIMIT 1