app/controllers/groups_controller.rb

  def show
    @group = Group.find(params[:id])
    @category = Category.find_all_for_user(current_user).reject { |category|  @group.category == category }
---
SELECT `groups`.* FROM `groups` WHERE `groups`.`id` = 137 LIMIT 1
SELECT `categories`.* FROM `categories` WHERE `categories`.`id` = 116 LIMIT 1
SELECT `groups`.* FROM `groups` WHERE `groups`.`user_id` = 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1