app/controllers/settings_controller.rb

  def edit
    @setting = Setting.first
---
SELECT `settings`.* FROM `settings` LIMIT 1