app/controllers/templates_controller.rb

  def index
    @templates = Template.all
---
SELECT `templates`.* FROM `templates`

  def show
    @template = Template.find(params[:id])
    @var = @template.content
    @user = User.first
---
SELECT `templates`.* FROM `templates` WHERE `templates`.`id` = 16 LIMIT 1
SELECT `users`.* FROM `users` LIMIT 1